# DBeam_End

## Description
End drawing beam routine and create the beam.

```pascal
PROCEDURE DBeam_End;
```

```python
def vs.DBeam_End():
    return None
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight